---
kind: other
id: Properties.T:Autodesk.Revit.DB.BaseArray
source: html/bfbb96c9-cde2-4eb3-041c-0999b81d0656.htm
---
# BaseArray Properties

The id of the assembly instance to which the element belongs.